I believe I have this working in a compatible fashion now, but it is ultimately going to be a breaking change release despite my best efforts to work around that and attempt some form of a migration path.

Running a `terraform plan` against my test data I get the following:
```
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ksk.aws_route53_key_signing_key.this["example.com"] will be created
  + resource "aws_route53_key_signing_key" "this" {
      + digest_algorithm_mnemonic  = (known after apply)
      + digest_algorithm_type      = (known after apply)
      + digest_value               = (known after apply)
      + dnskey_record              = (known after apply)
      + ds_record                  = (known after apply)
      + flag                       = (known after apply)
      + hosted_zone_id             = (known after apply)
      + id                         = (known after apply)
      + key_management_service_arn = (known after apply)
      + key_tag                    = (known after apply)
      + name                       = (known after apply)
      + public_key                 = (known after apply)
      + signing_algorithm_mnemonic = (known after apply)
      + signing_algorithm_type     = (known after apply)
      + status                     = "ACTIVE"
    }

  # module.ksk.random_string.ksk["example.com"] will be created
  + resource "random_string" "ksk" {
      + id          = (known after apply)
      + keepers     = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.ksk.module.kms_key.aws_kms_alias.default[0] will be created
  + resource "aws_kms_alias" "default" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/kms-key-test"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.ksk.module.kms_key.aws_kms_key.default[0] will be created
  + resource "aws_kms_key" "default" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "ECC_NIST_P256"
      + deletion_window_in_days            = 7
      + description                        = "Route53 DNSSEC customer managed CMK"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "SIGN_VERIFY"
      + multi_region                       = false
      + policy                             = jsonencode(
            {
              + Id        = "dnssec-policy"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::123456789012:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Sign",
                          + "kms:GetPublicKey",
                          + "kms:DescribeKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dnssec-route53.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Route 53 DNSSEC Service"
                    },
                  + {
                      + Action    = "kms:CreateGrant"
                      + Condition = {
                          + Bool = {
                              + kms:GrantIsForAWSResource = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dnssec-route53.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Route 53 DNSSEC to CreateGrant"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "Name" = "kms-key-test"
        }
      + tags_all                           = {
          + "Name" = "kms-key-test"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + this_key_arn = (known after apply)
```

This is executing it as follows:
```
module "ksk" {
  source = "github.com/ugns/terraform-aws-route53-dnssec?ref=devel"

  name    = "kms-key-test"
  zones   = {
    "example.com" = {
      zone_id = "12345678"
    }
  }
}
```

If you want to give this a test run yourself and validate that would be great. I'll then plan to release it as `1.0.0` with clear notice added to the `README.md` about breaking changes from versions `< 1.0.0`. As you'll note the `name` variable is required at a minimum or any other context variables for [cloudposse/label/null](https://github.com/cloudposse/terraform-null-label).